app/controllers/articles_controller.rb

  def index
    @articles = Article.search(params[:q], params[:page], 3)
---
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
	#render plain: params[:article].inspect

  	@article = Article.new(article_params)
  	if @article.save
---
INSERT INTO "articles" ("page_refer", "title", "author", "translate", "site", "editor", "press", "print", "print_date", "kword", "book_size", "pages_num", "cateory", "journal", "amount", "inner_flag", "bindery", "attr", "remark", "text", "old_text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "articles" SET "page_refer" = ?, "author" = ?, "print_date" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["page_refer", "12"], ["author", "tyujn"], ["print_date", "20171223"], ["text", "wertyuio\r\ndfghyujio\r\njfghjkl"], ["updated_at", "2016-01-10 13:23:20.869642"], ["id", 4]]